results/20251229_165022_envoy_passthrough/runs/run_1.txt
Running 1m test @ http://localhost:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.57ms    1.95ms  29.83ms   72.60%
    Req/Sec     2.93k   348.13     4.06k    73.62%
  Latency Distribution
     50%    8.34ms
     75%    9.62ms
     90%   11.00ms
     99%   14.44ms
  700417 requests in 1.00m, 8.96GB read
Requests/sec:  11670.82
Transfer/sec:    152.96MB